#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-management-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_virtual_network.virtual_network: Reading...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg]
azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg]
azurerm_resource_group.consumption_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00YjlkZWVkNC03ZDQxLTQ4ZTYtYTQyOS1iZWYzMjMyYjc0Nzc7b2JqZWN0SWQ9NGIyYjFlMTAtN2M0OS00MzM0LTgwZGQtYWI0MjQyYjczNTAzO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=]
azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg]
azurerm_resource_group.unity_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg]
data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001]
azurerm_subnet.databricks_public_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet]
azurerm_subnet.databricks_private_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet]
azurerm_subnet.private_endpoint_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet]
azurerm_synapse_private_link_hub.synapse_pl_hub: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001]
azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001]
azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001]
azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001]
azurerm_subnet_route_table_association.databricks_private_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet]
azurerm_subnet_network_security_group_association.databricks_private_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet]
azurerm_subnet_network_security_group_association.private_endpoint_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet]
azurerm_subnet_route_table_association.private_endpoint_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet]
azurerm_subnet_network_security_group_association.databricks_public_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet]
azurerm_subnet_route_table_association.databricks_public_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet]
azurerm_purview_account.purview: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001]
azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001]
azurerm_private_endpoint.synapse_pl_hub_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe]
azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001]
azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001]
azurerm_private_endpoint.databricks_private_endpoint_web: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe]
azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe]
azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe]
data.azapi_resource.purview: Reading...
azurerm_role_assignment.purview_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/ae3cc160-292e-2d1f-a7b0-d6722db8fb2c]
azurerm_role_assignment.user_assigned_identity_roleassignment_governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001/providers/Microsoft.Authorization/roleAssignments/89f6af3e-8a53-efd9-637b-399011ac936f]
azurerm_private_endpoint.purview_private_endpoint_account: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-account-pe]
azurerm_private_endpoint.purview_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-portal-pe]
data.azapi_resource.purview: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001]
azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe]
azurerm_private_endpoint.purview_private_endpoint_queue: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-queue]
azurerm_private_endpoint.purview_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-blob]
azurerm_private_endpoint.purview_private_endpoint_namespace: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-pe-namespace]
azapi_resource.datalake_container_unity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/blobServices/default/containers/unitynortheurope]
azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/managementPolicies/default]
azurerm_role_assignment.databricks_access_connector_roleassignment_datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/providers/Microsoft.Authorization/roleAssignments/def201e5-18bf-2f90-0dff-8eb9ebc271cf]
azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe]
azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe]
databricks_metastore.metastore: Refreshing state... [id=9884193e-1edc-4ddd-8e9c-ce570e9cc57a]
databricks_metastore_assignment.metastore_assignment: Refreshing state... [id=100126627990109|9884193e-1edc-4ddd-8e9c-ce570e9cc57a]
databricks_metastore_data_access.metastore_data_access: Refreshing state... [id=9884193e-1edc-4ddd-8e9c-ce570e9cc57a|d76c4804-9485-43bc-b437-bc725f0a85ca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azapi_resource.datalake_container_unity must be replaced
-/+ resource "azapi_resource" "datalake_container_unity" {
      ~ id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/blobServices/default/containers/unitynortheurope" -> (known after apply)
      + location                  = (known after apply)
        name                      = "unitynortheurope"
      ~ output                    = jsonencode({}) -> (known after apply)
      ~ parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/blobServices/default" # forces replacement -> (known after apply)
      ~ tags                      = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_private_endpoint.datalake_private_endpoint_blob must be replaced
-/+ resource "azurerm_private_endpoint" "datalake_private_endpoint_blob" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe" -> (known after apply)
        name                          = "mydmgmtdevst001-blob-pe"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevst001-blob-nic"
              - name = "mydmgmtdevst001-blob-nic"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe/privateDnsZoneGroups/mydmgmtdevst001-blob-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "mydmgmtdevst001.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.0.16.14",
                        ]
                      - name         = "mydmgmtdevst001"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                          = {} -> null
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe/privateDnsZoneGroups/mydmgmtdevst001-blob-arecord" -> (known after apply)
            name                 = "mydmgmtdevst001-blob-arecord"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "mydmgmtdevst001-blob-pe"
          ~ private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001" # forces replacement -> (known after apply)
          ~ private_ip_address             = "10.0.16.14" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_private_endpoint.datalake_private_endpoint_dfs must be replaced
-/+ resource "azurerm_private_endpoint" "datalake_private_endpoint_dfs" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe" -> (known after apply)
        name                          = "mydmgmtdevst001-dfs-pe"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevst001-dfs-nic"
              - name = "mydmgmtdevst001-dfs-nic"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe/privateDnsZoneGroups/mydmgmtdevst001-dfs-arecord/privateDnsZoneConfigs/privatelink.dfs.core.windows.net"
              - name                = "privatelink.dfs.core.windows.net"
              - private_dns_zone_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "mydmgmtdevst001.privatelink.dfs.core.windows.net"
                      - ip_addresses = [
                          - "10.0.16.15",
                        ]
                      - name         = "mydmgmtdevst001"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                          = {} -> null
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe/privateDnsZoneGroups/mydmgmtdevst001-dfs-arecord" -> (known after apply)
            name                 = "mydmgmtdevst001-dfs-arecord"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "mydmgmtdevst001-dfs-pe"
          ~ private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001" # forces replacement -> (known after apply)
          ~ private_ip_address             = "10.0.16.15" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_role_assignment.databricks_access_connector_roleassignment_datalake must be replaced
-/+ resource "azurerm_role_assignment" "databricks_access_connector_roleassignment_datalake" {
      ~ id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/providers/Microsoft.Authorization/roleAssignments/def201e5-18bf-2f90-0dff-8eb9ebc271cf" -> (known after apply)
      ~ name                             = "def201e5-18bf-2f90-0dff-8eb9ebc271cf" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001" # forces replacement -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.datalake must be replaced
-/+ resource "azurerm_storage_account" "datalake" {
      ~ id                                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001" -> (known after apply)
        name                              = "mydmgmtdevst001"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://mydmgmtdevst001.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "mydmgmtdevst001.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://mydmgmtdevst001.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "mydmgmtdevst001.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://mydmgmtdevst001.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "mydmgmtdevst001.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "northeurope" -> (known after apply)
      ~ primary_queue_endpoint            = "https://mydmgmtdevst001.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "mydmgmtdevst001.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://mydmgmtdevst001.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "mydmgmtdevst001.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://mydmgmtdevst001.z16.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "mydmgmtdevst001.z16.web.core.windows.net" -> (known after apply)
      ~ queue_encryption_key_type         = "Service" -> "Account" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      ~ table_encryption_key_type         = "Service" -> "Account" # forces replacement
      - tags                              = {} -> null
        # (19 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_management_policy.datalake_management_policy must be replaced
-/+ resource "azurerm_storage_management_policy" "datalake_management_policy" {
      ~ id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/managementPolicies/default" -> (known after apply)
      ~ storage_account_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001" # forces replacement -> (known after apply)

      ~ rule {
            name    = "default"
            # (1 unchanged attribute hidden)

          ~ actions {
              ~ base_blob {
                  - auto_tier_to_hot_from_cool_enabled                             = false -> null
                    # (10 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ filters {
              - prefix_match = [] -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>